{
  "explanations": {
    "low": {
      "Hemoglobin": "Low hemoglobin may indicate anemia, causing fatigue and weakness. Consult your doctor.",
      "White Blood Cell Count": "Low WBC can affect your immune system. This may indicate infections or bone marrow issues.",
      "Red Blood Cell Count": "Low RBC may cause fatigue and shortness of breath. Could indicate anemia.",
      "Platelet Count": "Low platelets may increase bleeding or bruising risk. Your doctor should investigate.",
      "Hematocrit": "Low hematocrit may indicate anemia or blood loss.",
      "MCV": "Low MCV suggests small red blood cells, often due to iron deficiency.",
      "MCH": "Low MCH may indicate iron deficiency anemia.",
      "Fasting Blood Sugar": "Low blood sugar can cause shakiness, sweating, confusion. Eat something sweet immediately.",
      "HbA1c": "Low HbA1c is generally good but may indicate frequent low blood sugar episodes.",
      "Creatinine": "Low creatinine is usually not concerning.",
      "eGFR": "Low eGFR indicates reduced kidney function. Consult a nephrologist.",
      "TSH": "Low TSH may indicate overactive thyroid (hyperthyroidism).",
      "T3": "Low T3 may indicate thyroid dysfunction.",
      "T4": "Low T4 may indicate underactive thyroid.",
      "HDL Cholesterol": "Low HDL (good cholesterol) increases heart disease risk. Exercise can help.",
      "Sodium": "Low sodium can affect fluid balance and neurological function.",
      "Potassium": "Low potassium can affect heart rhythm and muscle function.",
      "Calcium": "Low calcium may affect bone health and muscle function.",
      "Vitamin D": "Low Vitamin D affects bone health and immunity. Sunlight and supplements can help.",
      "Vitamin B12": "Low B12 may cause fatigue, nerve problems. Supplements may be needed.",
      "Iron": "Low iron can cause anemia and fatigue. Diet changes or supplements may help.",
      "Ferritin": "Low ferritin indicates depleted iron stores.",
      "Albumin": "Low albumin may indicate liver or kidney problems, or malnutrition.",
      "Total Protein": "Low protein may indicate liver disease or malnutrition.",
      "Neutrophils": "Low neutrophils may increase infection risk.",
      "Lymphocytes": "Low lymphocytes may indicate immune system problems.",
      "Testosterone": "Low testosterone may cause fatigue, low libido. Consult an endocrinologist.",
      "default": "This value is below normal range. Please consult your doctor for evaluation."
    },
    "high": {
      "Hemoglobin": "High hemoglobin may indicate dehydration or a bone marrow condition.",
      "White Blood Cell Count": "High WBC can occur with infections, inflammation, or stress.",
      "Red Blood Cell Count": "High RBC may indicate dehydration or lung/heart conditions.",
      "Platelet Count": "High platelets may increase clotting risk. Further evaluation needed.",
      "Fasting Blood Sugar": "High fasting sugar may indicate prediabetes or diabetes. Lifestyle changes recommended.",
      "Post Prandial Blood Sugar": "High PP sugar indicates poor glucose control. Monitor diet and consult doctor.",
      "Random Blood Sugar": "High random sugar may indicate diabetes. Further testing recommended.",
      "HbA1c": "High HbA1c indicates poor blood sugar control over past 2-3 months. Lifestyle changes needed.",
      "Blood Urea": "High urea may indicate kidney problems or dehydration.",
      "Blood Urea Nitrogen": "High BUN may indicate kidney or liver problems, or dehydration.",
      "Creatinine": "High creatinine may indicate reduced kidney function. Consult a nephrologist.",
      "Uric Acid": "High uric acid can cause gout and kidney stones. Reduce purine-rich foods.",
      "Total Bilirubin": "High bilirubin may indicate liver problems or hemolysis.",
      "Direct Bilirubin": "High direct bilirubin may indicate bile duct obstruction.",
      "SGOT": "High SGOT indicates liver cell damage. Avoid alcohol, consult doctor.",
      "SGPT": "High SGPT indicates liver inflammation. Avoid alcohol and fatty foods.",
      "Alkaline Phosphatase": "High ALP may indicate liver or bone problems.",
      "GGT": "High GGT often indicates liver disease or alcohol use.",
      "TSH": "High TSH may indicate underactive thyroid (hypothyroidism). May need medication.",
      "T3": "High T3 may indicate overactive thyroid.",
      "T4": "High T4 may indicate hyperthyroidism.",
      "Total Cholesterol": "High total cholesterol increases heart disease risk. Diet and exercise recommended.",
      "LDL Cholesterol": "High LDL (bad cholesterol) clogs arteries. Reduce saturated fats.",
      "VLDL Cholesterol": "High VLDL indicates excess triglycerides.",
      "Triglycerides": "High triglycerides increase heart disease risk. Reduce sugar and alcohol.",
      "Sodium": "High sodium can increase blood pressure. Reduce salt intake.",
      "Potassium": "High potassium can affect heart rhythm. May need dietary changes.",
      "Calcium": "High calcium may indicate parathyroid problems or cancer.",
      "Phosphorus": "High phosphorus may indicate kidney problems.",
      "CRP": "High CRP indicates inflammation or infection in the body.",
      "ESR": "High ESR indicates inflammation. Further tests may be needed.",
      "Troponin I": "High troponin indicates heart muscle damage. Seek immediate medical attention.",
      "Troponin T": "High troponin T indicates heart muscle injury. Emergency evaluation needed.",
      "CPK-MB": "High CPK-MB may indicate heart muscle damage.",
      "BNP": "High BNP may indicate heart failure or heart strain.",
      "D-Dimer": "High D-dimer may indicate blood clots. Further evaluation needed.",
      "PSA": "High PSA needs evaluation for prostate issues.",
      "AFP": "High AFP may need liver evaluation.",
      "CEA": "High CEA needs cancer screening evaluation.",
      "Amylase": "High amylase may indicate pancreatitis.",
      "Lipase": "High lipase indicates pancreatic inflammation.",
      "Urine Protein": "Protein in urine may indicate kidney damage.",
      "Urine Glucose": "Glucose in urine indicates diabetes.",
      "Urine RBC": "Blood in urine needs urological evaluation.",
      "Urine WBC": "Pus cells in urine indicate urinary infection.",
      "Homocysteine": "High homocysteine increases heart disease risk.",
      "Cortisol": "High cortisol may indicate stress or Cushing's syndrome.",
      "Prolactin": "High prolactin may affect fertility. Consult an endocrinologist.",
      "default": "This value is above normal range. Please consult your doctor for evaluation."
    },
    "normal": {
      "default": "This value is within normal range, indicating good health for this test."
    }
  },
  "categories": {
    "hematology": "Blood cell tests to check overall blood health",
    "diabetes": "Tests to check blood sugar and diabetes control",
    "kidney": "Tests to evaluate kidney function",
    "liver": "Tests to check liver health and function",
    "thyroid": "Tests to evaluate thyroid gland function",
    "lipid": "Tests to check cholesterol and heart disease risk",
    "electrolytes": "Tests for body's mineral balance",
    "vitamins": "Tests for vitamin levels",
    "minerals": "Tests for essential minerals",
    "inflammation": "Tests to detect inflammation in body",
    "cardiac": "Heart-related tests",
    "coagulation": "Blood clotting tests",
    "tumor_markers": "Cancer screening markers",
    "hormones": "Hormone level tests",
    "infectious": "Tests for infections",
    "urinalysis": "Urine tests",
    "pancreas": "Pancreatic function tests",
    "autoimmune": "Tests for autoimmune conditions"
  }
}
